[
  {
    "id": "1",
    "title": "Morning Yoga in the Park",
    "time": "7:00 AM – 8:00 AM",
    "location": "Hyde Park, Sydney",
    "spots": 10,
    "tags": ["Today", "Fitness", "Outdoors"],
    "dateLabel": "Today",
    "description": "Start your day with a refreshing outdoor yoga session in Hyde Park. Suitable for beginners and all levels. The class focuses on gentle stretching, breathing exercises, and mindfulness to improve flexibility and reduce stress. Please bring your own yoga mat and water bottle."
  },
  {
    "id": "2",
    "title": "Tech Networking Meetup",
    "time": "6:30 PM – 8:30 PM",
    "location": "Startup Hub, Sydney",
    "spots": 25,
    "tags": ["Today", "Social", "Popular", "Indoors"],
    "dateLabel": "Today",
    "description": "Join local developers, entrepreneurs, and tech enthusiasts for an evening of networking and collaboration. The event includes short introduction talks followed by open networking sessions. A great opportunity to build professional connections and share innovative ideas."
  },
  {
    "id": "3",
    "title": "Weekend Hiking Trip",
    "time": "9:00 AM – 4:00 PM",
    "location": "Blue Mountains",
    "spots": 15,
    "tags": ["Outdoors", "Family"],
    "dateLabel": "Weekend",
    "description": "Enjoy a guided hiking adventure through the scenic Blue Mountains. Suitable for families and nature lovers, this full-day trip includes panoramic viewpoints, forest trails, and rest breaks. Participants should wear comfortable walking shoes and bring snacks and water."
  },
  {
    "id": "4",
    "title": "Community Music Night",
    "time": "7:00 PM – 9:00 PM",
    "location": "Community Hall, Sydney",
    "spots": 30,
    "tags": ["Music", "Social", "Popular"],
    "dateLabel": "This Week",
    "description": "Experience an exciting evening of live performances from local musicians and bands. Community Music Night is open to all ages and celebrates local talent. Attendees can relax, enjoy music, and connect with other community members in a welcoming atmosphere."
  },
  {
    "id": "5",
    "title": "Beginner Dance Class",
    "time": "5:30 PM – 6:30 PM",
    "location": "Dance Studio, Sydney",
    "spots": 18,
    "tags": ["Dance", "Fitness", "Indoors"],
    "dateLabel": "This Week",
    "description": "Learn basic dance techniques in a fun and supportive environment. This beginner-friendly class covers rhythm, coordination, and simple choreography. No prior experience is required. Wear comfortable clothing and shoes suitable for movement."
  },
  {
    "id": "6",
    "title": "Local Athletics Meetup",
    "time": "6:00 AM – 7:30 AM",
    "location": "Olympic Park, Sydney",
    "spots": 20,
    "tags": ["Athletics", "Fitness", "Outdoors"],
    "dateLabel": "This Week",
    "description": "Kickstart your morning with a structured athletics session at Olympic Park. Activities include light jogging, sprint drills, and group fitness exercises. Suitable for all fitness levels. Participants are encouraged to bring water and arrive 10 minutes early."
  }
]
